.doom.d/config.org
* My Doom Emacs's Configuration
** Basic Setup
*** Personal Information
#+begin_src elisp
(setq user-full-name "Pavit Kiatkraipob"
      user-mail-address "mek.kiatkrai@shopee.com")
#+end_src
*** Font
#+begin_src elisp
(setq doom-font (font-spec :family "Jetbrains Mono" :size 15 :weight 'semi-light))
#+end_src
*** Theme
#+begin_src elisp
(setq doom-theme 'doom-dracula)
#+end_src
*** Org Directory
#+begin_src elisp
(setq org-directory "~/org/")
#+end_src
*** Line Number
#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src
** Go Setup
- =go-impl= helps generate methods to implement a given interface
#+begin_src elisp :tangle packages.el
(package! go-impl)
#+end_src
#+begin_src elisp
(defun my/go-coverage-all ()
  "Show go coverage of current buffer."
  (interactive)
  (shell-command "go test -tags=integration -coverprofile=cover.out ./...")
  (go-coverage "cover.out"))

;; override Doom's function
(defun my/go-test-single ()
  (interactive)
  (if (string-match "_test\\.go" buffer-file-name)
      (save-excursion
        (re-search-backward "^func[ ]+\\(([[:alnum:]]*?[ ]?[*]?[[:alnum:]]+)[ ]+\\)?\\(Test[[:alnum:]_]+\\)(.*)")
        (+go--run-tests (concat "-tags=integration " "-run" "='" (match-string-no-properties 2) "'")))
    (error "Must be in a _test.go file")))

;; override Doom's function
(defun my/go-test-all ()
  (interactive)
  (+go--run-tests "-tags=integration"))

(map! :map go-mode-map
      :localleader
      (:prefix ("c" . "coverage")
       "a" #'go-coverage-all
       :prefix ("t" . "test")
       "s" #'my/go-test-single
       "a" #'my/go-test-all))
#+end_src

** Blogging
- =ox-hugo= help exporting Org file to Hugo markdown
#+begin_src elisp :tangle packages.el
(package! ox-hugo)
#+end_src
#+begin_src elisp
(use-package! ox-hugo
	:after ox)
#+end_src
